; domain
;; =====================================================================
;; Domena: Multi-modalny transport paczek (wersja STRIPS)
;; Rozszerzenia: :strips, :typing, :negative-preconditions
;; -- bez funkcji numerycznych, koszt = dlugosc planu (liczba akcji)
;; =====================================================================
(define (domain transport-strips)

  (:requirements :strips :typing :negative-preconditions)

  (:types
    package vehicle location - object
    truck plane ship - vehicle
  )

  (:predicates
    (at-pkg ?p - package ?l - location)
    (at-veh ?v - vehicle ?l - location)
    (in    ?p - package ?v - vehicle)
    (road-connected  ?l1 - location ?l2 - location)
    (air-connected   ?l1 - location ?l2 - location)
    (water-connected ?l1 - location ?l2 - location)
  )

  (:action load
    :parameters (?p - package ?v - vehicle ?l - location)
    :precondition (and (at-pkg ?p ?l) (at-veh ?v ?l))
    :effect (and (not (at-pkg ?p ?l)) (in ?p ?v))
  )

  (:action unload
    :parameters (?p - package ?v - vehicle ?l - location)
    :precondition (and (in ?p ?v) (at-veh ?v ?l))
    :effect (and (at-pkg ?p ?l) (not (in ?p ?v)))
  )

  (:action drive
    :parameters (?t - truck ?from - location ?to - location)
    :precondition (and (at-veh ?t ?from) (road-connected ?from ?to))
    :effect (and (not (at-veh ?t ?from)) (at-veh ?t ?to))
  )

  (:action fly
    :parameters (?pl - plane ?from - location ?to - location)
    :precondition (and (at-veh ?pl ?from) (air-connected ?from ?to))
    :effect (and (not (at-veh ?pl ?from)) (at-veh ?pl ?to))
  )

  (:action sail
    :parameters (?s - ship ?from - location ?to - location)
    :precondition (and (at-veh ?s ?from) (water-connected ?from ?to))
    :effect (and (not (at-veh ?s ?from)) (at-veh ?s ?to))
  )
)

; problem
;; =====================================================================
;; Wariant problemu: BEZ trasy morskiej
;; Cel eksperymentu: pokazac wplyw topologii -- planer musi uzyc samolotu.
;; =====================================================================
(define (problem transport-3pkg-no-water)
  (:domain transport-strips)

  (:objects
    pkg1 pkg2 pkg3                  - package
    warehouse portA portB shop
    airportA airportB               - location
    truck1 truck2 truck3 truck4     - truck
    plane1                          - plane
    ship1                           - ship
  )

  (:init
    (at-pkg pkg1 warehouse)
    (at-pkg pkg2 warehouse)
    (at-pkg pkg3 portA)

    (at-veh truck1 warehouse)
    (at-veh truck2 portB)
    (at-veh truck3 airportB)
    (at-veh truck4 shop)
    (at-veh ship1  portA)
    (at-veh plane1 airportA)

    (road-connected warehouse portA)    (road-connected portA warehouse)
    (road-connected warehouse airportA) (road-connected airportA warehouse)
    (road-connected portB shop)         (road-connected shop portB)
    (road-connected airportB shop)      (road-connected shop airportB)

    ;; BRAK polaczen wodnych (zerwany szlak morski)

    (air-connected airportA airportB)   (air-connected airportB airportA)
  )

  (:goal (and
    (at-pkg pkg1 shop)
    (at-pkg pkg2 shop)
    (at-pkg pkg3 shop)
  ))
)

; plan
1. (load pkg1 truck1 warehouse)
   deleted: (at-pkg pkg1 warehouse)
   added: (in pkg1 truck1)
   goals met: 0 of 3
2. (load pkg2 truck1 warehouse)
   deleted: (at-pkg pkg2 warehouse)
   added: (in pkg2 truck1)
   goals met: 0 of 3
3. (drive truck1 warehouse porta)
   deleted: (at-veh truck1 warehouse)
   added: (at-veh truck1 porta)
   goals met: 0 of 3
4. (load pkg3 truck1 porta)
   deleted: (at-pkg pkg3 porta)
   added: (in pkg3 truck1)
   goals met: 0 of 3
5. (drive truck1 porta warehouse)
   deleted: (at-veh truck1 porta)
   added: (at-veh truck1 warehouse)
   goals met: 0 of 3
6. (drive truck1 warehouse airporta)
   deleted: (at-veh truck1 warehouse)
   added: (at-veh truck1 airporta)
   goals met: 0 of 3
7. (unload pkg1 truck1 airporta)
   deleted: (in pkg1 truck1)
   added: (at-pkg pkg1 airporta)
   goals met: 0 of 3
8. (load pkg1 plane1 airporta)
   deleted: (at-pkg pkg1 airporta)
   added: (in pkg1 plane1)
   goals met: 0 of 3
9. (unload pkg3 truck1 airporta)
   deleted: (in pkg3 truck1)
   added: (at-pkg pkg3 airporta)
   goals met: 0 of 3
10. (load pkg3 plane1 airporta)
   deleted: (at-pkg pkg3 airporta)
   added: (in pkg3 plane1)
   goals met: 0 of 3
11. (unload pkg2 truck1 airporta)
   deleted: (in pkg2 truck1)
   added: (at-pkg pkg2 airporta)
   goals met: 0 of 3
12. (load pkg2 plane1 airporta)
   deleted: (at-pkg pkg2 airporta)
   added: (in pkg2 plane1)
   goals met: 0 of 3
13. (fly plane1 airporta airportb)
   deleted: (at-veh plane1 airporta)
   added: (at-veh plane1 airportb)
   goals met: 0 of 3
14. (unload pkg1 plane1 airportb)
   deleted: (in pkg1 plane1)
   added: (at-pkg pkg1 airportb)
   goals met: 0 of 3
15. (load pkg1 truck3 airportb)
   deleted: (at-pkg pkg1 airportb)
   added: (in pkg1 truck3)
   goals met: 0 of 3
16. (unload pkg3 plane1 airportb)
   deleted: (in pkg3 plane1)
   added: (at-pkg pkg3 airportb)
   goals met: 0 of 3
17. (load pkg3 truck3 airportb)
   deleted: (at-pkg pkg3 airportb)
   added: (in pkg3 truck3)
   goals met: 0 of 3
18. (unload pkg2 plane1 airportb)
   deleted: (in pkg2 plane1)
   added: (at-pkg pkg2 airportb)
   goals met: 0 of 3
19. (load pkg2 truck3 airportb)
   deleted: (at-pkg pkg2 airportb)
   added: (in pkg2 truck3)
   goals met: 0 of 3
20. (drive truck3 airportb shop)
   deleted: (at-veh truck3 airportb)
   added: (at-veh truck3 shop)
   goals met: 0 of 3
21. (unload pkg1 truck3 shop)
   deleted: (in pkg1 truck3)
   added: (at-pkg pkg1 shop)
   goals met: 1 of 3
22. (unload pkg3 truck3 shop)
   deleted: (in pkg3 truck3)
   added: (at-pkg pkg3 shop)
   goals met: 2 of 3
23. (unload pkg2 truck3 shop)
   deleted: (in pkg2 truck3)
   added: (at-pkg pkg2 shop)
   goals met: 3 of 3
